{
    "all": [
        {
            "title": "What are template arrays?",
            "author": "slavcoder",
            "content": [
                ["p", {"class": "paragraph"}],
                    "This is an experiment concept of rendering html by javascript arrays. I believe it may be useful in some JavaScript libraries or maybe even for a simple templates like in this example.",
                ["/p"],
                ["h3"],"How it works?",["/h3"],
                ["p"],
                    "The idea is simple. Let's look right into example, the simple template could look like this:",
                    ["pre"],
                        "const exampleArray = [\n",
                        "    ['h1', {attr:'heading', id:'heading'}],\n",
                        "        'heading text',\n",
                        "    ['/h1'],\n",
                        "    ['div'],\n",
                        "        ['p', {class:'paragraph'}],\n",
                        "            {var:'paragraph'},\n",
                        "        ['/p'],\n",
                        "        ['a', {href:'#'}],`link text`,['a'],\n",
                        "    ['/div']\n",
                        "]",
                    ["/pre"],
                ["/p"],
                ["p", {"class": "paragraph"}],
                    "Like you can see, it is a valid javascript array.",
                ["/p"],
                ["p", {"class": "paragraph"}],
                    "HTML tags are represented by opening tag name plus list of its attributes <code>['h1', {id:'heading'}]</code>, and the closing tag name <code>['/h1']</code>",
                ["/p"],
                ["p", {"class": "paragraph"}],
                    "Text is represented by simple 'string' or `template string`",
                ["/p"],
                ["p", {"class": "paragraph"}],
                    "Object literals represents variables. Each time you render new html by using template arrays you can easly put another template array or plain text in place of this literals.",
                ["/p"],
                ["p", {"class": "paragraph"}],
                    "Even though it may looks more complicated then template strings, I think it gives more flexibility and clarity.",
                ["/p"],
                ["p", {"class": "paragraph"}],
                    "The render function which you have to import takes two arguments, array and object. Rendering the example above could look like this:<br>",
                ["/p"],
                ["pre"],
                    "document.body.innerHTML = render(exampleArray, {\n",
                    "    attr: {\n",
                    "        heading: {\n",
                    "            class: 'heading',\n",
                    "            style: 'color: red;'\n",
                    "        }\n",
                    "    },\n",
                    "    var: {\n",
                    "        paragraph: [ ['span'],'lorem',['/span'] ]\n",
                    "    }\n",
                    "})",
                ["/pre"],
                ["p", {"class": "paragraph"}],
                    "The <b>attr</b> is used to update attributes and the <b>var</b> is used to insert some other template array or string.",
                ["/p"]
            ]
        },
        {
            "title": "Advanteges of template arrays",
            "author": "slavcoder",
            "content": [
                ["p"],
                    "\"Using arrays to render html? Is there a doctor in this file?\"",
                ["p"],
                ["p"],"<b>Advanteges:</b>",["p"],
                ["ul", {"class": "paragraph"}],
                    ["li"],"you can use them inside .json file (this article is an example of it) and still use <b>var</b> and <b>attr</b> to change parts of its content and attributes of elements just before render html",
                    ["li"],"easy to use - no need function for every template, <b>template arrays</b> are ready to use after define",["/li"],
                    ["li"],"easy to learn, it is basicly <b>html</b> inside arrays",
                    ["li"],"pretty fast, test below is: ",
                        ["ul"],
                            ["li"],"up to <b>10 000</b> span elements",["/li"],
                            ["li"],"each element have random background color",["/li"],
                            ["li"],"you can choose to order them from lightest to darkest and vice verse",["/li"],
                            ["li"],"each element have font color black or white (depends on background color)",["/li"],
                            ["li"],"you can check in console rendering time (it depends on your machine obviously and can be much faster without this ridiculous color calculations i made)",["/li"],
                        ["/ul"],
                    ["/li"],
                ["/ul"],
                ["p"],
                    "And of course, this is a simple demostration - it can be done by <b>template strings</b> as well, but I think that <b>template arrays</b> have more possiblities (they can work together too). I'm working on JS library using this concept for simple render and manipalate DOM - nothing special, just another experiment (lawa, version 1.0.0 not there yet).",
                ["/p"]
            ]
        }
    ]
}